{
  "privacyText": "GIZLILIK POLITIKASI\n\nSon Guncelleme: 20 Aralik 2025\n\nBu Gizlilik Politikasi, Alevi adli mobil uygulamanin (\"Uygulama\") kullanicilarinin kisisel verilerinin nasil toplandigini, kullanildigini ve korundugunu aciklamak amaciyla hazirlanmistir.\n\nUygulamayi kullanarak bu Gizlilik Politikasi'nda belirtilen sartlari kabul etmis sayilirsiniz.\n\n1. Veri Sorumlusu\n\nUygulama Adi: Alevi\nYayinci: Cafer Merdane\nDuzenleyen ve Hak Sahibi: Nergis Merdane\nWeb Sitesi: https://alevi.app\nYasal Adres: Yakuplu Mah. Hurriyet Blv. Skyport Residence No: 1/151 Beylikduzu, Istanbul / Turkiye\nTelefon: 0850 305 25 58\n\n2. Toplanan Veriler\n\nAlevi uygulamasi, kullanicidan hesap olusturma, kayit olma veya giris yapma gibi islemler talep etmez. Bu nedenle ad, soyad, e-posta adresi gibi dogrudan kimlik bilgileri toplanmaz.\n\n2.1 Konum Verileri\nKonum izni, Cemevi Bulucu ozelliginin calisabilmesi icin talep edilir. Konum bilgisi yalnizca kullanici istegiyle ve anlik olarak kullanilir. Konum verileri sunucularda saklanmaz.\n\n2.2 Takvim Erisimi\nKullanici, uygulama icindeki etkinlikleri kendi takvimine eklemek isterse iOS takvim erisim izni talep edilir. Takvim verileri okunmaz, disa aktarilmaz veya saklanmaz.\n\n2.3 Uygulama Ici Satin Alma (Premium)\nUygulama icinde bazi ozelliklere erisim icin Apple App Store uzerinden Premium satin alma yapilabilir. Odeme islemleri Apple tarafindan gerceklestirilir. Odeme bilgileri gelistirici tarafindan gorulmez veya saklanmaz.\n\n2.4 Analitik Veriler\nUygulama, kullanici deneyimini gelistirmek amaciyla Google Analytics kullanir. Toplanan veriler anonimdir ve kullaniciyi dogrudan tanimlamaz.\n\n3. Verilerin Saklanmasi\n\nVerilerin buyuk bolumu kullanicinin cihazinda lokal olarak saklanir. Zorunlu olmadikca sunucuya kisisel veri gonderilmez.\n\n4. Verilerin Paylasimi\n\nVeriler ucuncu sahislarla satilmaz veya kiralanmaz. Yalnizca yasal yukumlulukler ve anonim analiz hizmetleri kapsaminda sinirli paylasim yapilabilir.\n\n5. Cocuklarin Gizliligi\n\nUygulama 13 yas altindaki cocuklara yonelik olarak tasarlanmamistir.\n\n6. Kullanici Haklari\n\nKullanicilar, konum ve takvim izinlerini iOS ayarlarindan istedikleri zaman devre disi birakabilir.\n\n7. Veri Guvenligi\n\niOS platformunun sundugu guvenlik onlemleri kullanilir ve yetkisiz erisime karsi teknik tedbirler alinmistir.\n\n8. Degisiklikler\n\nBu Gizlilik Politikasi zaman zaman guncellenebilir ve yayinlandigi anda yururluge girer.\n\n9. Iletisim\n\nGizlilik Politikasi ile ilgili sorular icin https://alevi.app adresi uzerinden iletisime gecilebilir.",
  "termsText": "KULLANIM SOZLESMESI\n\nSon Guncelleme: 20 Aralik 2025\n\nIsbu Kullanım Sozlesmesi, Alevi adli mobil uygulamanin (\"Uygulama\") kullanimi sirasinda kullanici ile yayinci arasindaki sartlari ve kosullari belirler.\n\nUygulamayi indirerek, kurarak veya kullanarak bu sozlesmede yer alan tum sartlari kabul etmis sayilirsiniz.\n\n1. Taraflar\n\nUygulama Adi: Alevi\nYayinci: Cafer Merdane\nDuzenleyen ve Hak Sahibi: Nergis Merdane\nWeb Sitesi: https://alevi.app\n\n2. Hizmetin Kapsami\n\nAlevi uygulamasi; Alevi inanci ve kulturune iliskin bilgilendirici icerikler, dijital deneyimler ve istege bagli ozellikler sunar. Sunulan icerikler bilgilendirme amaclidir ve yonlendirme niteliginde degildir.\n\n3. Uygulamanin Kullanimi\n\nKullanici, uygulamayi yalnizca hukuka uygun amaclarla kullanmayi kabul eder. Uygulamanin isleyisini bozacak, tersine muhendislik yapacak veya yetkisiz erisim saglayacak eylemler yasaktir.\n\n4. Premium Ozellikler ve Odeme\n\nUygulama icindeki bazi ek ozellikler Apple App Store uzerinden uygulama ici satin alma (Premium) ile sunulabilir. Odeme islemleri Apple tarafindan gerceklestirilir. Iade ve faturalandirma kosullari Apple politikalarina tabidir.\n\n5. Fikri Mulkiyet Haklari\n\nUygulama iceriginde yer alan tum metinler, gorseller, tasarimlar ve diger unsurlar ilgili hak sahiplerine aittir. Izinsiz kopyalanamaz, cogaltilamaz veya dagitilamaz.\n\n6. Sorumlulugun Sinirlandirilmasi\n\nUygulama, mevcut haliyle sunulmakta olup kesintisiz veya hatasiz calisacagi taahhut edilmez. Kullanici, uygulamayi kendi sorumlulugu altinda kullandigini kabul eder.\n\n7. Ucuncu Taraf Hizmetler\n\nUygulama, analiz ve performans olcumu amaciyla ucuncu taraf hizmetler (or. Google Analytics) kullanabilir. Bu hizmetlerin kendi kosullari ve gizlilik politikalari gecerlidir.\n\n8. Sozlesmenin Degistirilmesi\n\nIsbu sozlesme, gerekli gorulmesi halinde guncellenebilir. Yapilan degisiklikler yayinlandigi tarihten itibaren gecerlilik kazanir.\n\n9. Uygulanacak Hukuk ve Yetki\n\nIsbu Kullanım Sozlesmesi, Turkiye Cumhuriyeti hukukuna tabidir. Dogabilecek uyusmazliklarda Istanbul Mahkemeleri ve Icra Daireleri yetkilidir.\n\n10. Iletisim\n\nKullanım Sozlesmesi ile ilgili sorular icin https://alevi.app adresi uzerinden iletisime gecilebilir.",
  "knowledgeItems": [
    {
      "id": "k1",
      "title": "4 Kapı 40 Makam",
      "content": "Hacı Bektaş Veli'nin öğretisinin temelidir. Şeriat, Tarikat, Marifet ve Hakikat kapılarını içerir.",
      "category": "Yol & Erkan",
      "icon": "door.left.hand.open"
    }
  ],
  "stories": [
    {
      "id": "s1",
      "title": "Hacı Bektaş Veli ve Güvercin",
      "content": "Anadolu'ya gelirken barışın simgesi güvercin donunda geldiği rivayet edilir."
    }
  ],
  "rumors": [
    {
      "id": "r1",
      "title": "Kerbela",
      "content": "Hz. Hüseyin ve yoldaşlarının şehadeti."
    }
  ],
  "calendarEvents": [],
  "lokmaRecipes": [
    {
      "id": "l1",
      "title": "Un Helvası",
      "desc": "Niyaz helvası.",
      "ingredients": "Un, yağ, şeker, su.",
      "steps": "Kavur ve şerbetle.",
      "image": "helva"
    }
  ],
  "semahItems": [
    {
      "id": "sm1",
      "title": "Kırklar Semahı",
      "content": "Kırklar meclisinde dönülen semah."
    }
  ],
  "niyazItems": [
    {
      "id": "n1",
      "title": "Sofraya Gülbank",
      "content": "Bismişah... Artsın eksilmesin."
    }
  ],
  "quotes": [
    {
      "id": "q1",
      "quote": "İncinsen de incitme.",
      "author": "Hacı Bektaş Veli"
    }
  ]
}
